%%------------------   常规根轨迹   -------------------%%
% 开环传递函数G(s) = K(s+1)/s(s+2)(s+3)
% 绘制系统根轨迹
% rlocus()
num=[1 1];
den = conv([1 0],conv([1 2],[1 3]));
G=tf(num,den);
rlocus(G);
title('G(s)=K(s+1)/s(s+2)(s+3) 根轨迹');
xlabel('Re');
ylabel('Im');

% G(s)=K(s^2+2s+4)/s(s+4)(s+6)(s^2+1.4s+1)
num=[1 2 4];
den=conv([1 0],conv([1 4],conv([1 6],[1 1.4 1])));
G=tf(num,den);
rlocus(G);
xlabel('Re');
ylabel('Im');

% 状态空间表达式  x'=Ax+Bu  y=Cx+Du 
% A=[0 1 0;0 0 1;-160 -56 -14]  B=[0;1;-14]
% C=[1 0 0]   D=[0]
A=[0 1 0;0 0 1;-160 -56 -14];
B=[0 1 -14]';C=[1 0 0];D=[0];
rlocus(A,B,C,D);
xlabel('Re');
ylabel('Im');


%%------------------   广义根轨迹   -------------------%%
%%-----------  参数根轨迹 -------------%%
% G(s)H(s) = 10(1+Ks)/s(s+2)
% => D(s) = s^2+(2+10K)s+10 = 0;
% => 1+10Ks/(s^2+2s+10) = 0
% => G'(s)=10Ks/(s^2+2s+10) = K's/(s^2+2s+10)  K'=10K
num=[1 0];
den=[1 2 10];
G=tf(num,den);
rlocus(G);
xlabel('Re');
ylabel('Im');

%%-----------  零度根轨迹 -------------%%
% 正反馈系统
% 1 - G(s)H(s) = 0
% => |G(s)H(s)| = 1
%    ∠G(s)H(s) = arg[G(s)H(s)] = i*360

